/**
  ******************************************************************************
  * @File    transmit_conf.h
  * @Author  王北洛 <beiluo.wang@139.com>
  * @Date    Sun May 17 22:25:33 2020
  * @Brief   数据传输接口
  *
  *   根据实际使用的接口实现数据发送。
  *
  ******************************************************************************
  *                         Copyright (C) 2020 王北洛
  ******************************************************************************
  */

#ifndef __TRANSMIT_CONF_H
#define __TRANSMIT_CONF_H

/* Includes ------------------------------------------------------------------*/
#include <stdint.h>
#include <string.h>

/* Exported typedef ----------------------------------------------------------*/

/* Exported types ------------------------------------------------------------*/

/* Exported macro ------------------------------------------------------------*/

/**
  * 单次发送数据字节数，不同通信接口实现相同长度的数据发送
  */
#define TRANSMIT_LENGTH  8

/* Exported functions --------------------------------------------------------*/

void transmit(uint8_t *buf, uint16_t len);

#endif /* __TRANSMIT_CONF_H */

/***********************************END OF FILE********************************/
