/**
  ******************************************************************************
  * @File    swap.c
  * @Author  王北洛 <beiluo.wang@139.com>
  * @Date    Tue May 19 11:45:21 2020
  * @Brief   元素交换
  *
  *
  ******************************************************************************
  *                         Copyright (C) 2020 王北洛
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "swap.h"

#include <string.h>

/* Private typedef -----------------------------------------------------------*/

/* Private define ------------------------------------------------------------*/

/* Private macro -------------------------------------------------------------*/

/* Private variables ---------------------------------------------------------*/

/* Private function prototypes -----------------------------------------------*/

/* Private functions ---------------------------------------------------------*/

/* Public functions ----------------------------------------------------------*/

/**
  * @brief  交换数组中第i个元素和第j个元素的值
  *
  *  @param  value   被交换数组
  *  @param  length  被交换数组大小
  *  @param  i       数组元素索引
  *  @param  j       数组元素索引
  *
  * @retval 1   执行成功
  *         0   执行失败
  */
int32_t Swap_float_ary(float* value, uint32_t length, uint32_t i, uint32_t j)
{
    if (value == NULL)
        return 0;
    if (length == 0)
        return 0;
    if ((i >= length) || (j >= length))
        return 0;

    if (i == j)
        return 1;
    if (length == 1)
        return 0;

    float temp = *(value + i);
    *(value + i) = *(value + j);
    *(value + j) = temp;

    return 1;
}

/***********************************END OF FILE********************************/
